/*
 * Author: ybingyu
 * Version: 0.1.0
 * Compile Date: 2015-07-30 19:17
*/
/*
 * Author: ybingyu
 * Version: 0.1.0
 * Compile Date: 2015-07-25 20:51
*/
/*!
 * hbq.99.com 兵种资料 - 2.0
 * Copyright 1999-2015 hbq.99.com
 */

HIMGPATH = 'http://7xnz8p.com1.z0.glb.clouddn.com/hbq/huber/image/horse/';
var horse = {
	'xym':{
		'10001':{
			'hname':'骊戎文马',
			'hhead':'hd-head-lrwm.png',
			'hheaded':'selected-h-lrwm.png',
			'hposition':'1',
			'himg':'lrwm.png',
			'desc':'骊戎出产的毛皮带条纹的马种，《史记·周本纪》：“ 闳夭 之徒患之，乃求 有莘氏 美女， 骊戎 之文马， 有熊 九驷，他奇怪物，因 殷 嬖臣 费仲 而献之 纣 。”',
			'features':[185,6.3,0.79,2.12,221],
			'success':'<p>恭喜您，骊戎文马认为你的长相足以让母马芳心暗动</p> <p>由于你的脸仍未达到足够长度，我们暂时只能提供骊戎文马车接送</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，骊戎文马认为您长得太对不起他们马族的审美标准</p><p>首先，你的脸得足够长……</p><p>凭此信息可至N5馆虎豹骑展台领取精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'10002':{
			'hname':'秦马',
			'hhead':'hd-head-qm.png',
			'hheaded':'selected-h-qm.png',
			'hposition':'2',
			'himg':'qm.png',
			'desc':'秦马之良,戎兵之众,探前趹后,蹄间三寻。',
			'features':[175,6.2,0.78,2.11,199],
			'success':'<p>恭喜您，请张开嘴仰天长笑三声。</p> <p>秦马被你豪迈的笑容震得屁颠屁颠的，无法直视你</p> <p>因此我们将派秦马车接送您。</p><p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，您那一笑倾马心二笑倾马屁屁的笑容让秦马提不起双腿</p> <p>请张嘴开唱：“甜蜜蜜，你笑的甜蜜蜜，好像马儿吹在春风里……”</p> <p>凭此信息可至N5馆虎豹骑展台领取精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'10003':{
			'hname':'睼马',
			'hhead':'hd-head-tm.png',
			'hheaded':'selected-h-tm.png',
			'hposition':'3',
			'himg':'tm.png',
			'desc':'睼马是是秦从游牧族北翟引进的良马。李斯有云：“骏良睼马是不实外厩。”',
			'features':[183,6.4,0.81,2.12,193],
			'success':'<p>恭喜您，您输入的姓名似乎与这位睼马祖先的主人有着极深的血脉连接</p> <p>睼马很高兴的派遣附上他祖先灵魂的睼马车接送您。</p> <p>因此我们将派秦马车接送您。</p><p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，睼马家族的小儿子他外公的侄女的爸爸生病了</p> <p>虽然和你没什么关系，但是睼马就是这么任性的拒载</p> <p>弥补您受伤的心灵，凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'10004':{
			'hname':'西戎马',
			'hhead':'hd-head-xrm.png',
			'hheaded':'selected-h-xrm.png',
			'hposition':'5',
			'himg':'xrm.png',
			'desc':'西戎族出产的马匹，一般被认为是秦马的血统来源之一。',
			'features':[193,6.2,0.75,2.22,194],
			'success':'<p>恭喜您，您身上的多达30万的毛发数量让西戎马相当满意</p> <p>要是能达到50万西戎马将以身相许。</p> <p>为了防止人马之恋，我们临时替换为西戎马车接送。</p><p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，您钱包里青草的数量似乎并不能满足西戎马，</p> <p>咳咳，请无视西戎马那充满鄙视的眼神……</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'10005':{
			'hname':'有熊马',
			'hhead':'hd-head-yxm.png',
			'hheaded':'selected-h-yxm.png',
			'hposition':'6',
			'himg':'yxm.png',
			'desc':'有熊氏（楚国王室的祖先）出产的马种，《史记·周本纪》：“ 闳夭 之徒患之，乃求 有莘氏 美女， 骊戎 之文马， 有熊 九驷，他奇怪物，因 殷 嬖臣 费仲 而献之 纣 。',
			'features':[201,6.4,0.82,2.26,191],
			'success':'<p>恭喜您，您长的这么安全，一定肯定是一个从一而终人</p> <p>可是，为了您的人身安全，你还是快乘坐有熊马马车走吧。</p> <p>因为它已被你电晕</p><p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，有熊马自从第一眼见到你就觉得你不是一个从一而终的人</p> <p>有熊马很桑心，决定再也不见你！噗，长成这样，怪你咯</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		}
	},
	'hxm':{
		'20001':{
			'hname':'键为马',
			'hhead':'hd-head-jwm.png',
			'hheaded':'selected-h-jwm.png',
			'hposition':'2',
			'himg':'dwm.png',
			'desc':'安帝元时在键为（四川省乐山市）设置了汉平苑。',
			'features':[179,6.6,0.81,2.22,186],
			'success':'<p>恭喜您，你真是犯贱界的祖师爷，没人比你更贱了！</p> <p>键为马甘拜下风，已哭晕在厕所，我们临时替换为键为马马车接送。</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，你的犯贱指数太低，键为马完全看不起你！</p> <p>请丢掉节操，重新储存犯贱能量后再来吧</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'20002':{
			'hname':'昆蹄马',
			'hhead':'hd-head-ktm.png',
			'hheaded':'selected-h-ktm.png',
			'hposition':'6',
			'himg':'ktm.png',
			'desc':'良马，善于登山。《尔雅》：“昆余,枝蹄趼,善升 ”。',
			'features':[181,6.3,0.85,2.12,181],
			'success':'<p>恭喜您，根正苗红的昆蹄马认为您长得像牛头，适合上交给国家。</p> <p>因此昆蹄马将让他的好基友马车带您前往国家博物馆，请静待片刻。</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，昆蹄马说花色不同怎么交朋友。</p> <p>建议您出门左转第二个路口右拐大概二百五个马步的距离的油漆店里逛一逛，拿好不谢！</p> <p>如果不想去，凭此信息可至N5馆虎豹骑展台领取精美周边一份。</p><p>此外，您也可以重新挑选战马进行预约。</p>'
		},
		'20003':{
			'hname':'乾河马',
			'hhead':'hd-head-qhm.png',
			'hheaded':'selected-h-qhm.png',
			'hposition':'13',
			'himg':'qhm.png',
			'desc':'《汉官仪》：乾河马，华山神马种也。',
			'features':[188,6.5,0.82,2.02,184],
			'success':'<p>恭喜您，乾河马误以为您是它的初恋小花花。</p> <p>现在正在到处寻找表白神器黑凤梨，向您表白</p> <p>它派出的马车正准备接送您到达表白地点，请上车接受乾河马的满满爱意。</p><p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，连地球都找到了另一半，而乾河马还是单身马。</p> <p>所以单身马最近很难过，并且想让你更难过。</p> <p>为了弥补单身马对单身狗造成的伤害</p><p>凭此信息可至N5馆虎豹骑展台领取精美周边一份。</p><p>此外，您也可以重新挑选战马进行预约。</p>'
		},
		'20004':{
			'hname':'益州马',
			'hhead':'hd-head-yizm.png',
			'hheaded':'selected-h-yizm.png',
			'hposition':'7',
			'himg':'yizm.png',
			'desc':'安帝元时在益州郡（今昆明一代）设置了万岁苑。',
			'features':[198,6.1,0.83,1.97,193],
			'success':'<p>恭喜您，益州马认为你长得那么像它亲戚马云一定是干大事的人呢。</p> <p>它将派出最爱的坐骑来迎接你，与你看雪看月亮从诗词歌赋谈到人生哲学。</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份。</p>',
			'fail':'<p>很抱歉，益州马以“你丑没事但我不瞎”的理由拒绝了你。</p> <p>建议您整成它的男神孙悟空齐天大圣的模样（往脸上贴点草假装是猴毛什么的）。</p> <p>凭此信息可至N5馆虎豹骑展台领取精美周边一份。</p><p>此外，您也可以重新挑选战马进行预约。</p>'
		},
		'20005':{
			'hname':'越巂马',
			'hhead':'hd-head-yxim.png',
			'hheaded':'selected-h-yxim.png',
			'hposition':'9',
			'himg':'yxim.png',
			'desc':'安帝元初时增设了越巂（在今四川会理县境）的长利、 高望、 始昌三苑。',
			'features':[203,6.0,0.83,1.98,192],
			'success':'<p>恭喜您，越大爷今儿心情好决定答应你！</p> <p>但是为了预防女神冰的马震事件上演，贴心的它将派出与它有过共捡肥皂情的车，</p> <p>接送您到最近的优衣库。</p><p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，越巂马表示明明规定了建国以后动物不准成精。</p> <p>你丑你可以，它却不可以！</p> <p>伐开心！拒绝你！</p><p>为了安慰小妖精你，凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份。</p><p>此外，您也可以重新挑选战马进行预约。</p>'
		}
	},
	'hqm':{
		'30001':{
			'hname':'焉耆马',
			'hhead':'hd-head-ysm.png',
			'hheaded':'selected-h-ysm.png',
			'hposition':'15',
			'himg':'ysm.png',
			'desc':'西域国家焉耆出产的马种。焉耆东汉时期一度为北匈奴控制。',
			'features':[189,6.6,0.82,2.31,199],
			'success':'<p>恭喜您，您孔武有力的鼻孔和丰盛的鼻毛都引起了焉耆马浓浓的兴趣</p> <p>为了防止它拔光您的鼻毛，保护您那360度无死角的完美鼻孔，我们临时替换为焉耆马马车接送。</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，您的鼻孔无论是直径，还是吞吐量都未能令焉耆马满意</p> <p>怎能与鼻孔有吞吐千里之势的焉耆马相提并论呢？</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'30002':{
			'hname':'大宛马',
			'hhead':'hd-head-dwm.png',
			'hheaded':'selected-h-dwm.png',
			'hposition':'17',
			'himg':'dwm.png',
			'desc':'西域国家大宛出产的优质马种',
			'features':[192,6.7,0.82,2.32,196],
			'success':'<p>恭喜您，大宛马肯定了你无可匹敌的魅力</p> <p>但鉴于您屁股翘起的弧度无法达到完美的85°</p> <p>我们暂时只能为您提供大宛宝马车接送</p><p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，由于您叉腰肌不够发达，大宛马并不认可你</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p> <p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'30003':{
			'hname':'乌孙马',
			'hhead':'hd-head-wsm.png',
			'hheaded':'selected-h-wsm.png',
			'hposition':'19',
			'himg':'wsm.png',
			'desc':'西域民族乌孙出产的的优质马种，被认为是现代伊犁马的祖先',
			'features':[192,6.8,0.82,2.31,199],
			'success':'<p>恭喜您，乌孙马刚才被雷电击中，突然就对你有感觉了。</p> <p>为了防止它过于兴奋，把你推倒在地，我们临时替换为西戎马车接送。</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，乌孙马与您不来电。</p> <p>感情是勉强不来的，你还是放弃吧！</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'30004':{
			'hname':'龟兹马',
			'hhead':'hd-head-yzm.png',
			'hheaded':'selected-h-yzm.png',
			'hposition':'12',
			'himg':'yzm.png',
			'desc':'魏书 高祖纪 记载，太和二年九月， 龟兹国遣使献大马 名驼，珍宝甚众。龟兹在东汉时一度被北匈奴控制',
			'features':[191,6.6,0.81,2.21,200],
			'success':'<p>恭喜您，虽然您拥有无与伦比的阔叶肌</p> <p>但显然还未达到龟兹马心中最完美的标准</p><p>我们暂时只能为您提供龟兹马马车接送</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，由于您的阔叶肌不够紧致，未达到龟兹马满意度的最低标准</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		},
		'30005':{
			'hname':'紫骍马',
			'hhead':'hd-head-zxm.png',
			'hheaded':'selected-h-zxm.png',
			'hposition':'11',
			'himg':'zxm.png',
			'desc':'魏书 高祖纪 记载，太和二年九月， 龟兹国遣使献大马 名驼，珍宝甚众。龟兹在东汉时一度被北匈奴控制',
			'features':[190,6.6,0.80,2.30,192],
			'success':'<p>恭喜，就是您了，如您这般“面如冠玉、唇红齿白、面如傅粉、玉树临风 ”</p> <p>驾驭紫骍马非你莫属啊</p><p>等等，紫骍马突然罢工，系统提示：紫骍马被您的万丈光芒灼伤双眼</p><p>我们暂时只能为您提供紫骍马马车接送</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p>',
			'fail':'<p>很抱歉，不是我打击您，以您的身高，要想驾驭紫骍马略显尴尬阿</p> <p>凭此信息可至N5馆虎豹骑展台领取乘车卷及精美周边一份</p><p>此外，您也可以重新挑选战马进行预约</p>'
		}
	}
}
