/*
 * Author: ybingyu
 * Version: 0.1.0
 * Compile Date: 2015-08-12 15:35
*/ 
/**
 * 测试题目
 * '题目序号（数字）' : {
 * 		'question' : '题目',
 * 		'option' :{
 * 			'A' : {
 * 				'text' : '显示文字',
 * 				'to' : 跳转题号(不带引号)/跳转结果(字母 带引号)
 * 			},
 * 			...
 * 		},
 * 	},
 */
var test = {
	1 : {
		'question' : '食堂吃饭的时候遇到不熟但心仪的女生在很后面排队，你会选择？',
		'option' :{
			'A' : {
				'text' : '询问对方是否要插队站你前面',
				'to' : 2
			},
			'B' : {
				'text' : '两眼望天，深藏功与名',
				'to' : 3
			},
			'C' : {
				'text' : '强行将女生拉在自己身前',
				'to' : 4
			}
		},
	},
	2 : {
		'question' : '朋友就世界和平问题激烈探讨并发展为拳脚交加，这时候你会',
		'option' :{
			'A' : {
				'text' : '坚定自己的信念，正义必胜！加入你认为正确的一方战斗',
				'to' : 4
			},
			'B' : {
				'text' : '我并不是战斗民族，打吧打吧与我何干',
				'to' : 5
			},
			'C' : {
				'text' : '和平鸽灵魂附体，总之先化干戈为玉帛再说',
				'to' : 6
			}
		},
	},
	3 : {
		'question' : '考试之前完全没有复习，但你爹妈又很在意这次考试，在考场上你将',
		'option' :{
			'A' : {
				'text' : '燃烧吧小宇宙，一路选C，快速结束战斗！',
				'to' : '4'
			},
			'B' : {
				'text' : '你永不会独行，找前后左右桌各路大腿们让我抱抱',
				'to' : '5'
			},
			'C' : {
				'text' : '尽人事听天命，连蒙带猜尽力拿到更高的分数',
				'to' : '6'
			}
		},
	},
	4 : {
		'question' : '考试之前完全没有复习，但你爹妈又很在意这次考试，在考场上你将',
		'option' :{
			'A' : {
				'text' : '燃烧吧小宇宙，一路选C，快速结束战斗！',
				'to' : 7
			},
			'B' : {
				'text' : '你永不会独行，找前后左右桌各路大腿们让我抱抱',
				'to' : 5
			},
			'C' : {
				'text' : '尽人事听天命，连蒙带猜尽力拿到更高的分数',
				'to' : 6
			}
		},
	},
	5 : {
		'question' : 'KTV唱歌的时候朋友唱的动情之处仰天突然大哭，你会',
		'option' :{
			'A' : {
				'text' : '兄弟一生一起走，大家一起放声哭',
				'to' : 8
			},
			'B' : {
				'text' : '我走我的独木桥，你哭你得与我何干？',
				'to' : 9
			},
			'C' : {
				'text' : '轻搂朋友双肩，问明痛苦缘由并安慰',
				'to' : 7
			}
		},
	},
	6 : {
		'question' : '聚餐的时候，无数美味食物堆在你面前，你将采取什么方式食用呢？',
		'option' :{
			'A' : {
				'text' : '管你多少食物，我按照我的节奏吃',
				'to' : 10
			},
			'B' : {
				'text' : '这么多食物太爽了！全部一起吃，来多少吃多少',
				'to' : 9
			},
			'C' : {
				'text' : '谋划一番，每样吃一点，看看之后还会不会再有更好的食物',
				'to' : 12
			}
		},
	},
	7 : {
		'question' : '发现好兄弟也在对你心仪的妹纸发动猛烈的攻势，你会',
		'option' :{
			'A' : {
				'text' : '情场无兄弟，相约紫禁之巅，就是干不要怂',
				'to' : 8
			},
			'B' : {
				'text' : '各凭各的真本事，看谁真正笑到最后',
				'to' : 12
			},
			'C' : {
				'text' : '含着热泪，默默注视，我想起那天夕阳下的奔跑……',
				'to' : 9
			}
		},
	},
	8 : {
		'question' : '遇到不得不对女朋友说谎的时候',
		'option' :{
			'A' : {
				'text' : '面不改色心不跳，一路谎话好话说到底',
				'to' : 11
			},
			'B' : {
				'text' : '我是老实人，我选择坦白从宽',
				'to' : 10
			},
			'C' : {
				'text' : '先试着遮掩一下，见势头不对马上坦白',
				'to' : 12
			}
		},
	},
	9 : {
		'question' : '听到“雪”会想起什么',
		'option' :{
			'A' : {
				'text' : '雪一片一片一片一片……',
				'to' : 10
			},
			'B' : {
				'text' : '冬天来了，春天还会远吗？',
				'to' : 11
			},
			'C' : {
				'text' : '没有任何感觉，出题者脑袋有病吧？',
				'to' : 12
			}
		},
	},
	10 : {
		'question' : '前方有贼在疯狂行窃，这是你扬名立万的时候，你会',
		'option' :{
			'A' : {
				'text' : '呵呵，没偷我就行',
				'to' : 'J'
			},
			'B' : {
				'text' : '戴上战斗力测试仪估算双方战斗力差',
				'to' : 'F'
			},
			'C' : {
				'text' : '老子就爱路见不平拔刀相助，来信砍！',
				'to' : 'A'
			}
		},
	},
	11 : {
		'question' : '心爱的手办遭受熊孩子亲戚疯狂变态的攻击，你会',
		'option' :{
			'A' : {
				'text' : '怒发冲冠，对熊孩子展开反杀，鸡毛掸子参上',
				'to' : 'G'
			},
			'B' : {
				'text' : '四处游走，确保四周没有熊孩子父母，开始战斗',
				'to' : 'C'
			},
			'C' : {
				'text' : '尽情的破坏把熊孩子，最后请陪我三倍钱！',
				'to' : 'E'
			}
		},
	},
	12 : {
		'question' : '交往7年的女朋友要跟你闹分手，因为你偷看了一位大妈一眼，你会',
		'option' :{
			'A' : {
				'text' : '陈述利弊，激扬文字，表面自己的无辜祈求原谅',
				'to' : 'H'
			},
			'B' : {
				'text' : '分就分，我怕你啊！好男儿志在四方',
				'to' : 'B'
			},
			'C' : {
				'text' : '二话不说，直接下跪认错，好话说尽祈求原谅',
				'to' : 'D'
			}
		},
	},
};
/**
 * 测试结果
 * '结果序号(大写字母)' : {
 *		'tit' : '结果',
 *		'url':'跳转地址',
 *		'talk':['出题者吐槽','测试者反吐槽']
 *	}
 */
var result = {
	'A' : {
		'tit' : '魏国长兵步兵系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=0&&ki=0',
		'talk':['有勇无谋，难成大事','小哥你家局何处啊？看我不卸了你']
	},
	'B' : {
		'tit' : '魏国重骑兵系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=0&&ki=1',
		'talk':['人渣败类偶像楷模！','不要崇拜哥，这是哥帅的特权，丑人靠边站']
	},
	'C' : {
		'tit' : '魏国弓骑兵系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=0&&ki=2',
		'talk':['你就是大怂货！','我看一下，嘿嘿小哥原来你孤身一人啊……']
	},
	'D' : {
		'tit' : '蜀国短兵步兵系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=1&&ki=0',
		'talk':['男人队伍怎么有你这样的蛀虫','这位小哥你肯定单身']
	},
	'E' : {
		'tit' : '蜀国重弩兵系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=1&&ki=1',
		'talk':['超级心机婊，我们是好朋友对吧？','好兄弟，哥有一个发财计划需要投资……']
	},
	'F' : {
		'tit' : '蜀国弩骑兵系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=1&&ki=2',
		'talk':['你就是欺软怕硬的主儿','我算一下，出题者战斗力5，兄弟们操家伙上啊']
	},
	'G' : {
		'tit' : '吴国短兵步兵系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=2&&ki=0',
		'talk':['你这干正面的典型反面教材','你滚开，挡我者死']
	},
	'H' : {
		'tit' : '吴国长兵步兵系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=2&&ki=1',
		'talk':['屌丝注定孤独一生','这位兄台此言差矣#！@@#！#&￥']
	},
	'J' : {
		'tit' : '吴国步弓系',
		'url':'http://hbq.99.com/guide/info.shtml?index=3&&ci=2&&ki=2',
		'talk':['你这胆小鬼','呵呵，you can you up……']
	}
};
